app/controllers/repositories_controller.rb

SELECT  "profiles".* FROM "profiles" WHERE "profiles"."username" = ? LIMIT 1  [["username", "masonfmatthews"]]
SELECT  1 AS one FROM "profiles" WHERE "profiles"."username" = 'masonfmatthews' LIMIT 1
INSERT INTO "profiles" ("number_following", "number_of_followers", "company_name", "location", "avatar_url", "username", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def show
    @profile = Profile.find_by_username(params[:username])
    if @profile.blank? || @profile.updated_at < Time.now - 1.day
      @profile = Profile.create_or_update_username(params[:username], @profile)